app/controllers/locations_controller.rb

INSERT INTO "locations" ("address", "city", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "peachtree"], ["city", "san antonio"], ["latitude", 33.9420457], ["longitude", -84.2938124], ["created_at", "2018-09-20 14:38:23.422511"], ["updated_at", "2018-09-20 14:38:23.422511"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_location
      @location = Location.find(params[:id])